Билет16/Reports/ПерерасчетЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ПерерасчетЗарплаты</Name>
		</Properties>
	</Report>
</MetaDataObject>

Билет16/CalculationRegisters/ДопНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ДопНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Билет16/Reports/ПерерасчетЗарплаты/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьПересчетНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПерерасчетЗарплаты.ОбъектПерерасчета КАК Регистратор,
		|	ПерерасчетЗарплаты.Сотрудник КАК Сотрудник,
		|	ПерерасчетЗарплаты.Подразделение КАК Подразделение,
		|	НАЧАЛОПЕРИОДА(ПерерасчетЗарплаты.ОбъектПерерасчета.Дата, МЕСЯЦ) КАК ПериодРегистрации
		|ИЗ
		|	РегистрРасчета.ДопНачисления.ПерерасчетЗарплаты КАК ПерерасчетЗарплаты
		|ИТОГИ
		|	МАКСИМУМ(ПериодРегистрации)
		|ПО
		|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДопОтбор	= Новый ТаблицаЗначений;
	ДопОтбор.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));	
	ДопОтбор.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));	
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРегистратор.Следующий() Цикл
		ДопОтбор.Очистить();
		
		Выборка	= ВыборкаРегистратор.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтрОтбора				= ДопОтбор.Добавить();
			НовСтрОтбора.Сотрудник		= Выборка.Сотрудник;			
			НовСтрОтбора.Подразделение	= Выборка.Подразделение;			
		КонецЦикла;
		
		Расчет.Рассчитать(ВыборкаРегистратор.Регистратор, ВыборкаРегистратор.ПериодРегистрации, ДопОтбор);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПересчет(Команда)
	ВыполнитьПересчетНаСервере();
	СкомпоноватьРезультат();	
КонецПроцедуры
